[
  {
    "title": "E-commerce",
    "content": "E-commerce (electronic commerce) refers to commercial activities including the electronic buying or selling products and services which are conducted on online platforms or over the Internet. E-commerce draws on technologies such as mobile commerce, electronic funds transfer, supply chain management, Internet marketing, online transaction processing, electronic data interchange (EDI), inventory management systems, and automated data collection systems. E-commerce is a part of the retail, the largest segment of the electronics industry and is in turn driven by the technological advances of the semiconductor industry.\n\n\nDefining e-commerce\nThe term was coined and first employed by Robert Jacobson, Principal Consultant to the California State Assembly's Utilities & Commerce Committee, in the title and text of California's Electronic Commerce Act, carried by the late Committee Chairwoman Gwen Moore (D-L.A.) and enacted in 1984.\nE-commerce typically uses the web for at least a part of a transaction's life cycle although it may also use other technologies such as e-mail. Typical e-commerce transactions include the purchase of products (such as books from Amazon) or services (such as music downloads in the form of digital distribution such as the iTunes Store). There are three areas of e-commerce: online retailing, electronic markets, and online auctions. E-commerce is supported by electronic business. The existence value of e-commerce is to allow consumers to shop online and pay online through the Internet, saving the time and space of customers and enterprises, greatly improving transaction efficiency, especially for busy office workers, and also saving a lot of valuable time.\nE-commerce businesses may also employ some or all of the following:\n\nOnline shopping for retail sales direct to consumers via web sites and mobile apps, conversational commerce via live chat, chatbots, and voice assistants.\nProviding or participating in online marketplaces, which process third-party business-to-consumer (B2C) or consumer-to-consumer (C2C) sales;\nBusiness-to-business (B2B) buying and selling.\nDirect-to-Consumer(D2C) sales, in which manufactures or brands sell directly to end customers without traditional retail intermediaries. This model has expanded rapidly with the growth of digital storefronts and social commerce platforms such as Shopify, TikTok Shop, and Instagram Checkout.\nData-driven marketing, gathering demographic and behavioral data through web analytics and social media.\nB2B electronic data interchange.\nMarketing to prospective and established customers by e-mail or fax (for example, with newsletters).\nEngaging in pretail for launching new products and services.\nOnline financial exchanges for currency exchanges or trading purposes.\nThere are five essential categories of E-commerce:\n\nBusiness to Business\nBusiness to Consumer\nBusiness to Government\nConsumer to Business\nConsumer to Consumer\nDirect to Consumer\n\n\nForms\nContemporary electronic commerce can b",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/E-commerce"
  },
  {
    "title": "Customer service",
    "content": "Customer service is the assistance and advice provided by a company to those who buy or use its products or services, either in person or remotely. Customer service is often practiced in a way that reflects the strategies and values of a firm, and levels vary according to the industry. Good quality customer service is usually measured through customer retention. Successful customer service interactions are dependent on employees \"who can adjust themselves to the personality of the customer\".\nCustomer service in some cases is part of the firm's intangible assets and can differentiate it from others in the industry. One good customer service experience can change the entire perception a customer holds towards the organization. It is expected that AI-based chatbots will significantly impact customer service and call centre roles and will increase productivity substantially. Many organisations have already adopted AI chatbots to improve their customer service experience.\nThe evolution in the service industry has identified the needs of consumers. Companies usually create policies or standards to guide their personnel to follow their particular service package. A service package is a combination of tangible and intangible characteristics a firm uses to take care of its clients.\n\n\nCustomer support\n\nCustomer support is a range of consumer services to assist customers in making cost-effective and correct use of a product. It includes assistance in planning, installation, training, troubleshooting, maintenance, upgrading, and disposal of a product. These services may even be provided at the place in which the customer makes use of the product or service. In this case, it is called \"at home customer service\" or \"at home customer support.\" Customer support is an effective strategy that ensures that the customer's needs have been attended to. Customer support helps ensure that the products and services that have been provided to the customer meet their expectations. When receiving an effective and efficient customer support experience, customers tend to be loyal to the organization, which creates a competitive advantage over its competitors. Organizations should ensure that any complaints from customers about customer support have been dealt with effectively.\n\n\nAutomation and productivity increase\nCustomer service may be provided in person (e.g. sales / service representative), or by automated means, such as kiosks, websites, and apps. An advantage of automation is that it can provide service 24 hours a day which can complement face-to-face customer service. There is also economic benefit to the firm. Through the evolution of technology, automated services become less expensive over time. This helps provide services to more customers for a fraction of the cost of employees' wages. Automation can facilitate customer service or replace it entirely.\nA popular type of automated customer service is done through artificial intelligence (AI). The customer benefit o",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Customer_service"
  },
  {
    "title": "Online shopping",
    "content": "Online shopping is a form of electronic commerce which allows consumers to directly buy goods or services from a seller over the Internet using a web browser or a mobile app. Consumers find a product of interest by visiting the website of the retailer directly or by searching among alternative vendors using a shopping search engine, which displays the same product's availability and pricing at different e-retailers. As of 2020, customers can shop online using a range of different computers and devices, including desktop computers, laptops, tablet computers and smartphones.\nOnline stores that evoke the physical analogy of buying products or services at a regular \"brick-and-mortar\" retailer or shopping center follow a process called business-to-consumer (B2C) online shopping. When an online store is set up to enable businesses to buy from another business, the process is instead called business-to-business (B2B) online shopping. A typical online store enables the customer to browse the firm's range of products and services, view photos or images of the products, along with information about the product specifications, features and prices. Unlike physical stores which may close at night, online shopping portals are always available to customers.\nOnline stores usually enable shoppers to use \"search\" features to find specific models, brands or items. Online customers must have access to the Internet and a valid method of payment in order to complete a transaction, such as a credit card, an Interac-enabled debit card, or a service such as PayPal. For physical products (e.g., paperback books or clothes), the e-tailer ships the products to the customer; for digital products, such as digital audio files of songs or software, the e-tailer usually sends the file to the customer over the Internet. The largest of these online retailing corporations are Alibaba, Amazon.com, and eBay.\n\n\nTerminology\nAlternative names for the activity are \"e-commerce\", a shortened form of \"electronic commerce\" or \"e-shopping\", a shortened form of \"electronic shopping\". An online store may also be called an e-web-store, e-shop, e-store, Internet shop, web-shop, web-store, online store, online storefront and virtual store. Mobile commerce (or m-commerce) describes purchasing from an online retailer's mobile device-optimized website or software application (\"app\"). These websites or apps are designed to enable customers to browse through a companies' products and services on tablet computers and smartphones.\n\n\nHistory\n\n\nHistory of online shopping\nOne of the earliest forms of trade conducted online was IBM's online transaction processing (OLTP) developed in the 1960s, which allowed the processing of financial transactions in real-time. The computerized ticket reservation system developed for American Airlines called Semi-Automatic Business Research Environment (SABRE) was one of its applications. There, computer terminals located in different travel agencies were linked to a large IB",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Online_shopping"
  },
  {
    "title": "Warranty",
    "content": "In law, a warranty is an expressed or implied promise or assurance of some kind.  The term's meaning varies across legal subjects. In property law, it refers to a covenant by the grantor of a deed. In insurance law, it refers to a promise by the purchaser of an insurance about the thing or person to be insured.\nIn contract law, a warranty is a contractual assurance given, typically, by a seller to a buyer, for example confirming that the seller is the owner of the property being sold. A warranty is a term of a contract, but not usually a condition of the contract or an innominate term, meaning that it is a term \"not going to the root of the contract\", and therefore only entitles the innocent party to damages if it is breached, i.e. if the warranty is not true or the defaulting party does not perform the contract in accordance with the terms of the warranty. A warranty is not a guarantee: it is a mere promise. It may be enforced if it is breached by an award for the legal remedy of damages.\nDepending on the terms of the contract, a product warranty may cover a product such that a manufacturer provides a warranty to a consumer with whom the manufacturer has no direct contractual relationship because it is purchased via an intermediary.\nA warranty may be express or implied. An express warranty is expressly stated (typically, written); whether or not a term will be implied into a contract depends on the particular contract law of the country in question. Warranties may also state that a particular fact is true at a point in time, or that the fact will continue into the future (a \"continuing warranty\").\n\n\nExpress warranty\n\nExpress warranties are created when the seller makes a guarantee to the buyer that the product or service being offered has certain qualities. For there to exist an express warranty, a statement regarding the product or service must be made to the buyer and the statement must play a role in the buyer's decision to purchase the product or service. If, after purchase, the buyer feels that the given statement was a misrepresentation of the actual product or service, the buyer can file for breach of express warranty.\n\n\nImplied warranty\n\nImplied warranties are unwritten promises that arise from the nature of the transaction, and the inherent understanding by the buyer, rather than from the express representations of the seller. \n\n\nSale of goods\n\nWarranties provided in the sale of goods (tangible products) vary according to jurisdiction, but commonly new goods are sold with implied warranty that the goods are as advertised. Used products, however, may be sold \"as is\" with no warranties. Each country, however, defines its own parameters with regard to implied conditions or implied warranties. The rules regarding warranties are largely standardised; i.e., the concepts of offer, acceptance, consideration, capacity to contract and intention to create legal relations. Those are the five elements to create a legally binding contract in the Unit",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Warranty"
  },
  {
    "title": "Payment system",
    "content": "A payment system is any system used to settle financial transactions through the transfer of monetary value. This includes the institutions, payment instruments such as payment cards, people, rules, procedures, standards, and technologies that make its exchange possible. A payment system is an operational network which links bank accounts and provides for monetary exchange using bank deposits. Some payment systems also include credit mechanisms, which are essentially a different aspect of payment.\nPayment systems are used in lieu of tendering cash in domestic and international transactions. This consists of a major service provided by banks and other financial institutions. Traditional payment systems include negotiable instruments such as drafts (e.g., cheques) and documentary credits such as letters of credit.  With the advent of computers and electronic communications, many alternative electronic payment systems have emerged. The term electronic payment refers to a payment made from one bank account to another using electronic methods and forgoing the direct intervention of bank employees. Narrowly defined electronic payment refers to e-commerce—a payment for buying and selling goods or services offered through the Internet, or broadly to any type of electronic funds transfer.\nModern payment systems use cash-substitutes as compared to traditional payment systems. This includes debit cards, credit cards, electronic funds transfers, direct credits, direct debits, internet banking and e-commerce payment systems.\nPayment systems may be physical or electronic and each has its own procedures and protocols. Standardization has allowed some of these systems and networks to grow to a global scale, but there are still many country-specific and product-specific systems. Examples of payment systems that have become globally available are credit card and automated teller machine (ATM) networks. Additionally, forms exist to transfer funds between financial institutions. Domestically this is accomplished by using Automated clearing house (ACH) and real-time gross settlement (RTGS) systems. Internationally this is accomplished by correspondent banking (possibly using the SWIFT network) or a more centralised system like the CLS settlement system.\n\n\nDomestic\nAn efficient national payment system reduces the cost of exchanging goods, services, and assets. It is indispensable to the functioning of the interbank, money, and capital markets. A weak payment system may severely drag on the stability and developmental capacity of a national economy. Such failures can result in inefficient use of financial resources, inequitable risk-sharing among agents, actual losses for participants, and loss of confidence in the financial system and in the very use of money. The technical efficiency of the payment system is important for the development of the economy.\nAn automated clearing house (ACH) system processes transactions in batches, storing, and transmitting them in group",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Payment_system"
  },
  {
    "title": "Customer relationship management",
    "content": "Customer relationship management (CRM) is a strategic process that organizations use to manage, analyze, and improve their interactions with customers. By using data-driven insights, CRM helps businesses optimize communication, enhance customer satisfaction, and drive sustainable growth.\nCRM systems compile data from a range of different communication channels, including a company's website, telephone (which many services come with a softphone), email, live chat, marketing materials and more recently, social media. They allow businesses to learn more about their target audiences and how to better cater to their needs, thus retaining customers and driving sales growth. CRM may be used with past, present or potential customers. The concepts, procedures, and rules that a corporation follows when communicating with its consumers are referred to as CRM. This complete connection covers direct contact with customers, such as sales and service-related operations, forecasting, and the analysis of consumer patterns and behaviours, from the perspective of the company.\nThe global customer relationship management market size is projected to grow from $101.41 billion in 2024 to $262.74 billion by 2032, at a CAGR of 12.6% \n\n\nHistory\nThe concept of customer relationship management started in the early 1970s, when customer satisfaction was evaluated using annual surveys or by front-line asking. At that time, businesses had to rely on standalone mainframe systems to automate sales, but the extent of technology allowed them to categorize customers in spreadsheets and lists. One of the best-known precursors of modern-day CRM is the Farley File. Developed by Franklin Roosevelt's campaign manager, James Farley, the Farley File was a comprehensive set of records detailing political and personal facts about people FDR and Farley met or were supposed to meet. Using it, people that FDR met were impressed by his \"recall\" of facts about their family and what they were doing professionally and politically. In 1982, Kate and Robert D. Kestenbaum introduced the concept of database marketing, namely applying statistical methods to analyze and gather customer data. By 1987, Pat Sullivan and Mike Muhney had released a customer evaluation system called ACT! based on the principle of a digital Rolodex, which offered a contact management service for the first time.\nThe trend was followed by numerous companies and independent developers trying to maximize lead potential, including Tom Siebel of Siebel Systems, who designed the first CRM product, Siebel Customer Relationship Management, in 1993. In order to compete with these new and quickly growing stand-alone CRM solutions, established enterprise resource planning (ERP) software companies like Oracle, Zoho Corporation, SAP, Peoplesoft (an Oracle subsidiary as of 2005) and Navision started extending their sales, distribution and customer service capabilities with embedded CRM modules. This included embedding sales force automation or",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Customer_relationship_management"
  },
  {
    "title": "Consumer protection",
    "content": "Consumer protection is the practice of safeguarding buyers of goods and services, and the public, against unfair practices in the marketplace. Consumer protection measures are often established by law. Such laws are intended to prevent businesses from engaging in fraud or specified unfair practices to gain an advantage over competitors or to mislead consumers. They may also provide additional protection for the general public which may be impacted by a product (or its production) even when they are not the direct purchaser or consumer of that product. For example, government regulations may require businesses to disclose detailed information about their products—particularly in areas where public health or safety is an issue, such as with food or automobiles.\nConsumer protection is linked to the idea of consumer rights and to the formation of consumer organizations, which help consumers make better choices in the marketplace and pursue complaints against businesses. Entities that promote consumer protection include government organizations (such as the Federal Trade Commission in the United States), self-regulating business organizations (such as the Better Business Bureaus in the US, Canada, England, etc.), and non-governmental organizations that advocate for consumer protection laws and help to ensure their enforcement (such as consumer protection agencies and watchdog groups).\nA consumer is defined as someone who acquires goods or services for direct use or ownership rather than for resale or use in production and manufacturing. Consumer interests can also serve consumers, consistent with economic efficiency, but this topic is treated in competition law. Consumer protection can also be asserted via non-government organizations and individuals as consumer activism.\nEfforts made for the protection of consumer's rights and interests include the right to:\n\nsatisfaction of basic needs\nsafety and health protection\nbe informed\nchoose and give consent\nbe heard\nredress\nconsumer education\na healthy environment\n\n\nConsumer law\nConsumer protection law or consumer law is considered as an area of law that regulates private law relationships between individual consumers and the businesses that sell those goods and services.\nConsumer protection covers a wide range of topics, including but not necessarily limited to product liability, privacy rights, unfair business practices, fraud, misrepresentation, and other consumer/business interactions. It is a way of preventing frauds and scams from service and sales contracts, eligible fraud, bill collector regulation, pricing, utility turnoffs, consolidation, personal loans that may lead to bankruptcy. There have been some arguments that consumer law is also a better way to engage in large-scale redistribution than tax law because it does not necessitate legislation and can be more efficient, given the complexities of tax law.\n\n\nAustralia\nIn Australia, the corresponding agency is the Australian Competition & Consumer ",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Consumer_protection"
  },
  {
    "title": "Supply chain",
    "content": "A supply chain is a complex logistics system that consists of facilities that convert raw materials into finished products and distribute them to end consumers or end customers, while supply chain management deals with the flow of goods in distribution channels within the supply chain in the most efficient manner.\nIn sophisticated supply chain systems, used products may re-enter the supply chain at any point where residual value is recyclable. Supply chains link value chains. Suppliers in a supply chain are often ranked by \"tier\", with first-tier suppliers (also called \"direct suppliers\") supplying directly to the client, second-tier suppliers supplying to the first tier, and so on.\nThe phrase \"supply chain\" may have been first published in a 1905 article in The Independent which briefly mentions the difficulty of \"keeping a supply chain with India unbroken\" during the British expedition to Tibet.\n\n\nOverview\n\nA typical supply chain can be divided into two stages namely, production and distribution stages. In the production stage, components and semi-finished parts are produced in manufacturing centres. The components are then put together in an assembly plant. The distribution stage consists of central and regional distribution centres that transport products to end-consumers. Mentzer et al. suggest that at least three entities are required for there to be a \"supply chain\".\nAt the end of the supply chain, materials and finished products only flow there because of the customer behaviour at the end of the chain; academics Alan Harrison and Janet Godsell argue that \"supply chain processes should be coordinated in order to focus on end customer buying behaviour\", and look for \"customer responsiveness\" as an indicator confirming that materials are able to flow \"through a sequence of supply chain processes in order to meet end customer buying behaviour\".\nMany of the exchanges encountered in the supply chain take place between varied companies that seek to maximize their revenue within their sphere of interest but may have little or no knowledge or interest in the remaining players in the supply chain. More recently, the loosely coupled, self-organizing network of businesses who cooperate in providing product and service offerings has been called the extended enterprise, and the use of the term \"chain\" and the linear structure it appears to represent have been criticized as \"harder to relate to the way supply networks really operate. A chain is actually a complex and dynamic supply and demand network.\nAs part of their efforts to demonstrate ethical practices, many large companies and global brands are integrating codes of conduct and guidelines into their corporate cultures and management systems. Through these, corporations are making demands on their suppliers (facilities, farms, subcontracted services such as cleaning, canteen, security etc.) and verifying, through social audits, that they are complying with the required standard. A lack of transpare",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Supply_chain"
  },
  {
    "title": "Inventory",
    "content": "Inventory (British English) or stock (American English) is a quantity of the goods and materials that a business holds for the ultimate goal of resale, production or utilisation.\nInventory management is a discipline primarily about specifying the shape and placement of stocked goods. It is required at different locations within a facility or within many locations of a supply network to precede the regular and planned course of production and stock of materials.\nThe concept of inventory, stock or work in process (or work in progress) has been extended from manufacturing systems to service businesses  and projects, by generalizing the definition to be \"all work within the process of production—all work that is or has occurred prior to the completion of production\". In the context of a manufacturing production system, inventory refers to all work that has occurred—raw materials, partially finished products, finished products prior to sale and departure from the manufacturing system. In the context of services, inventory refers to all work done prior to sale, including partially process information.\n\n\nBusiness inventory\n\n\nReasons for keeping stock\nThere are five basic reasons for keeping an inventory:\n\nTime: The time lags present in the supply chain, from supplier to user at every stage, requires that you maintain certain amounts of inventory to use in this lead time. However, in practice, inventory is to be maintained for consumption during 'variations in lead time'. Lead time itself can be addressed by ordering that many days in advance.\nSeasonal demand: Demands varies periodically, but producers capacity is fixed. This can lead to stock accumulation, consider for example how goods consumed only in holidays can lead to accumulation of large stocks on the anticipation of future consumption.\nUncertainty: Inventories are maintained as buffers to meet uncertainties in demand, supply and movements of goods.\nEconomies of scale: Ideal condition of \"one unit at a time at a place where a user needs it, when he needs it\" principle tends to incur lots of costs in terms of logistics. So bulk buying, movement and storing brings in economies of scale, thus inventory.\nAppreciation in value: In some situations, some stock gains the required value when it is kept for some time to allow it reach the desired standard for consumption, or for production. For example, beer in the brewing industry.\nAll these stock reasons can apply to any owner or product.\n\n\nSpecial terms used in dealing with inventory management\nStock Keeping Unit (SKU) SKUs are clear, internal identification numbers assigned to each of the products and their variants. SKUs can be any combination of letters and numbers chosen, just as long as the system is consistent and used for all the products in the inventory. An SKU code may also be referred to as product code, barcode, part number or MPN (Manufacturer's Part Number).\n\"New old stock\" (sometimes abbreviated NOS) is a term used in business to refer t",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Inventory"
  },
  {
    "title": "Retail",
    "content": "Retail is the sale of goods and services to consumers, in contrast to wholesaling, which is the sale to business or institutional customers. A retailer purchases goods in large quantities from manufacturers, directly or through a wholesaler, and then sells in smaller quantities to consumers for a profit. Retailers are the final link in the supply chain from producers to consumers.\nRetail markets and shops have a long history, dating back to antiquity. Some of the earliest retailers were itinerant peddlers. Over the centuries, retail shops were transformed from little more than \"rude booths\" to the sophisticated shopping malls of the modern era. In the digital age, an increasing number of retailers are seeking to reach broader markets by selling through multiple channels, including both bricks and mortar and online retailing. Digital technologies are also affecting the way that consumers pay for goods and services. Retailing support services may also include the provision of credit, delivery services, advisory services, stylist services and a range of other supporting services. Retail workers are the employees of such stores.\nMost modern retailers typically make a variety of strategic level decisions including the type of store, the market to be served, the optimal product assortment, customer service, supporting services, and the store's overall market positioning. Once the strategic retail plan is in place, retailers devise the retail mix which includes product, price, place, promotion, personnel, and presentation.\n\n\nEtymology\nThe word retail comes from the Old French verb retaillier, meaning \"to shape by cutting\" (c. 1365). It was first recorded as a noun in 1433 with the meaning of \"a sale in small quantities\" from the Middle French verb retailler meaning \"a piece cut off, shred, scrap, paring\". At present, the meaning of the word retail (in English, French, Dutch, German and Spanish) refers to the sale of small quantities of items to consumers (as opposed to wholesale).\n\n\nLegal definition and explanation\nRetail refers to the activity of selling goods or services directly to consumers or end-users. Some retailers may sell to business customers, and such sales are termed non-retail activity. In some jurisdictions or regions, legal definitions of retail specify that at least 80 percent of sales activity must be to end-users. In the banking industry \"wholesale\" usually refers to wholesale banking, providing tailored services to large customers, in contrast with retail banking, providing standardized services to large numbers of smaller customers.\nRetailing often occurs in retail stores or service establishments, but may also occur through direct selling such as through vending machines, door-to-door sales or electronic channels. Although the idea of retail is often associated with the purchase of goods, the term may be applied to service providers that sell to consumers. Retail service providers include retail banking, tourism, insurance, private",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Retail"
  },
  {
    "title": "Credit card",
    "content": "A credit card (or charge card) is a payment card, usually issued by a bank, allowing its users to purchase goods or services, or withdraw cash, on credit. Using the card thus accrues debt that has to be repaid later. Credit cards are one of the most widely used forms of payment across the world.\nA regular credit card differs from a charge card, which requires the balance to be repaid in full each month, or at the end of each statement cycle. In contrast, credit cards allow consumers to build a continuing balance of debt, subject to interest being charged at a specific rate. A credit card also differs from a charge card in that a credit card typically involves a third-party entity that pays the seller, and is reimbursed by the buyer, whereas a charge card simply defers payment by the buyer until a later date. A credit card also differs from a debit card, which can be used like currency by the owner of the card.\nAs of June 2018, there were 7.753 billion credit cards in the world. In 2020, there were 1.09 billion credit cards in circulation in the United States, and 72.5% of adults (187.3 million) in the country had at least one credit card.\n\n\nTechnical specifications\n\nThe size of most credit cards is 85.60 by 53.98 millimetres (3+3⁄8 in × 2+1⁄8 in) and rounded corners with a radius of 2.88–3.48 millimetres (9⁄80–11⁄80 in) conforming to the ISO/IEC 7810 ID-1 standard, the same size as ATM cards and other payment cards, such as debit cards. Most credit cards are made of plastic, but some are made from metal.\nCredit cards have a printed or embossed bank card number complying with the ISO/IEC 7812 numbering standard. The card number's prefix, called the Bank Identification Number (known in the industry as a BIN), is the sequence of digits at the beginning of the number that determine the bank to which a credit card number belongs. This is the first six digits for MasterCard and Visa cards. The next nine digits are the individual account number, and the final digit is a validity check digit.\nBoth of these standards are maintained and further developed by ISO/IEC JTC 1/SC 17/WG 1. Credit cards have a magnetic stripe conforming to the ISO/IEC 7813. Most modern credit cards use smart card technology: they have a computer chip embedded in them as a security feature. In addition, complex smart cards, including peripherals such as a keypad, a display or a fingerprint sensor are increasingly used for credit cards.\nIn addition to the main credit card number, credit cards also carry issue and expiration dates (given to the nearest month), as well as extra codes such as issue numbers and security codes. Complex smart cards allow to have a variable security code, thus increasing security for online transactions. Not all credit cards have the same sets of extra codes nor do they use the same number of digits.\nCredit card numbers and cardholder names were originally embossed, to allow for easy transfer of such information to charge slips printed on carbon paper form",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Credit_card"
  },
  {
    "title": "Refund",
    "content": "Refund may refer to:\n\n\nRefunds of money\nProduct return, a process in which a customer returns a product to the original retailer in exchange for money previously paid\nMoney back guarantee, a guarantee that, if a buyer is not satisfied with a product or service, a refund will be made\nTax refund, a refund on taxes when the tax liability is less than the taxes paid\nRefunding, when debt holders calls back bonds with the express purpose of reissuing new debt\nDeposit-refund system, a surcharge on a product when purchased and a rebate when it is returned\nTax-free shopping, allows shoppers to get a refund of any sales tax\n\n\nOther uses\nRefund (horse), won the 1888 Preakness Stakes\n\"The Refund,\" an episode of The Amazing World of Gumball\n\n\nSee also\nRebate (marketing)",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Refund"
  },
  {
    "title": "Privacy policy",
    "content": "A privacy policy is a statement or legal document (in privacy law) that discloses some or all of the ways a party gathers, uses, discloses, and manages a customer or client's data. Personal information can be anything that can be used to identify an individual, not limited to the person's name, address, date of birth, marital status, contact information, ID issue, and expiry date, financial records, credit information, medical history, where one travels, and intentions to acquire goods and services. In the case of a business, it is often a statement that declares a party's policy on how it collects, stores, and releases personal information it collects. It informs the client what specific information is collected, and whether it is kept confidential, shared with partners, or sold to other firms or enterprises. Privacy policies typically represent a broader, more generalized treatment, as opposed to data use statements, which tend to be more detailed and specific.\nThe exact contents of a certain privacy policy will depend upon the applicable law and may need to address requirements across geographical boundaries and legal jurisdictions. Most countries have own legislation and guidelines of who is covered, what information can be collected, and what it can be used for. In general, data protection laws in Europe cover the private sector, as well as the public sector. Their privacy laws apply not only to government operations but also to private enterprises and commercial transactions.\n\n\nHistory\nIn 1968, the Council of Europe began to study the effects of technology on human rights, recognizing the new threats posed by computer technology that could link and transmit in ways not widely available before. In 1969 the Organisation for Economic Co-operation and Development (OECD) began to examine the implications of personal information leaving the country. All this led the council to recommend that policy be developed to protect personal data held by both the private and public sectors, leading to Convention 108. In 1981, Convention for the Protection of Individuals with regard to Automatic Processing of Personal Data (Convention 108) was introduced. One of the first privacy laws ever enacted was the Swedish Data Act in 1973, followed by the West German Data Protection Act in 1977 and the French Law on Informatics, Data Banks and Freedoms in 1978.\nIn the United States, concern over privacy policy starting around the late 1960s and 1970s led to the passage of the Fair Credit Reporting Act. Although this act was not designed to be a privacy law, the act gave consumers the opportunity to examine their credit files and correct errors. It also placed restrictions on the use of information in credit records. Several congressional study groups in the late 1960s examined the growing ease with which automated personal information could be gathered and matched with other information. One such group was an advisory committee of the United States Department of Heal",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Privacy_policy"
  },
  {
    "title": "Product return",
    "content": "In retail, a product return is the process of a customer taking previously purchased merchandise back to the retailer, and in turn receiving a refund in the original form of payment, exchange.\n\n\nOverview\nMany retailers will accept returns provided that the customer has a receipt as a proof of purchase, and that certain other conditions, which depend on the retailer's policies, are met.  These may include the merchandise being in a certain condition (usually resellable if not defective), no more than a certain amount of time having passed since the purchase, and sometimes that identification be provided (though usually only if a receipt is not provided).  In some cases, only exchanges or store credit are offered, again usually only without a receipt, or after an initial refund period has passed. Some retailers charge a restocking fee for non-defective returned merchandise, but typically only if the packaging has been opened.\nIn certain countries, such as Australia, consumer rights dictate that under certain situations consumers have a right to demand a refund. These situations include sales that relied on false or misleading claims, defective goods, and undisclosed conditions of sale.\nThere are various reasons why customers may wish to return merchandise.  These include a change of one's mind (buyer's remorse), quality of the merchandise, personal dissatisfaction, or a mistaken purchase of the wrong product. For clothing or other sized items, it may be a lack of a correct fit.  Sometimes, there may be a product recall in which the manufacturer has requested (or been ordered) that the merchandise be brought back to the store.  Also, gift receipts are offered sometimes when an item is purchased for another person, and the recipient can exchange this item for another item of comparable value, or for store credit, often on a gift card.\n\n\nEconomic impact\nIn the US, an estimated 8–10% of in-store sales is returned whereas online sales may result in 25–40% returns.  In Asia and Europe, less than 5 percent of purchases are returned. US shoppers returned $396 billion worth of purchases in 2018 – brick-and-mortar and online, according to the National Retail Federation (NRF). To fight high return rates in e-commerce, a realistic product visualization is needed. Next to imagery and video content, 3D technology like augmented reality and virtual reality, but also simply 3D in the browser can enhance the shopping experience and lower return rates.\nIn the UK, Logistics costs for returns is estimated at between £20bn and £60bn per year. Figures show that 33% of retailers had to increase prices to counter rising returns volumes whilst 31% of retailers said managing returns impacts their profits. For some companies the costs of accepting returns amounts to as much as 5% of their annual turnover.\n\n\nIssues\n\n\nFraudulent returns\n\nIn the United States, various abuses using the return process allegedly cost retailers more than $9 billion annually.\nOne common practice is ",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Product_return"
  },
  {
    "title": "Customer satisfaction",
    "content": "Customer satisfaction is a term frequently used in marketing to evaluate customer experience. It is a measure of how products and services supplied by a company meet or surpass customer expectation. Customer satisfaction is defined as \"the number of customers, or percentage of total customers, whose reported experience with a firm, its products, or its services (ratings) exceeds specified satisfaction goals\". Enhancing customer satisfaction and fostering customer loyalty are pivotal for businesses, given the significant importance of improving the balance between customer attitudes before and after the consumption process.\nExpectancy disconfirmation theory is the most widely accepted theoretical framework for explaining customer satisfaction. However, other frameworks, such as equity theory, attribution theory, contrast theory, assimilation theory, and various others, are also used to gain insights into customer satisfaction. However, traditionally applied satisfaction surveys are influence by biases related to social desirability, availability heuristics, memory limitations, respondents' mood while answering questions, as well as affective, unconscious, and dynamic nature of customer experience. \nThe Marketing Accountability Standards Board endorses the definitions, purposes, and measures that appear in Marketing Metrics as part of its ongoing Common Language in Marketing Project. In a survey of nearly 200 senior marketing managers, 71 percent responded that they found a customer satisfaction metric very useful in managing and monitoring their businesses. Customer satisfaction is viewed as a key performance indicator within business and is often part of a balanced scorecard. In a competitive marketplace where businesses compete for customers, customer satisfaction is seen as a major differentiator and increasingly has become an important element of business strategy.\n\n\nPurpose\n\nCustomer satisfaction operates in relation to both consumer and business usage of goods and services. Farris et al. wrote that \"[c]ustomer satisfaction provides a leading indicator of consumer purchase intentions and loyalty\".\nThe authors also wrote that \"customer satisfaction data are among the most frequently collected indicators of market perceptions. Their principal use is twofold:\" \n\n\"Within organizations, the collection, analysis and dissemination of these data send a message about the importance of tending to customers and ensuring that they have a positive experience with the company's goods and services.\"\n\"Although sales or market share can indicate how well a firm is performing currently, satisfaction is perhaps the best indicator of how likely it is that the firm’s customers will make further purchases in the future. Much research has focused on the relationship between customer satisfaction and retention. Studies indicate that the ramifications of satisfaction are most strongly realized at the extremes.\"\nOn a five-point scale, \"individuals who rate their satis",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Customer_satisfaction"
  },
  {
    "title": "Payment gateway",
    "content": "A payment gateway is a merchant service provided by an e-commerce application service provider that authorizes credit card or direct payment processing for e-businesses, online retailers, bricks and clicks, or traditional brick and mortar. The payment gateway may be provided by a bank to its customers, but can be provided by a specialised financial service provider as a separate service, such as a payment service provider.\nA payment gateway facilitates a payment transaction by the transfer of information between a payment portal (such as a website, mobile phone or interactive voice response service) and the front end processor or acquiring bank.\nPayment gateways are a service that helps merchants initiate e-commerce, in-app, and point of sale payments for a broad variety of payment methods. The gateway is not directly involved in the money flow; typically it is a web server to which a merchant's website or POS system is connected. A payment gateway often connects several\nacquiring banks and payment methods under one system.\n\n\nTypical transaction processes\nWhen a customer orders a product from a payment gateway-enabled merchant, the payment gateway performs a variety of tasks to process the transaction.\n\nThe order is placed.\nThe payment gateway may allow transaction data to be sent directly from the customer's browser to the gateway, bypassing the merchant's systems, using redirect or iframe. This reduces the merchant's PCI DSS compliance obligations without redirecting the customer away from the website.\nThe merchant forwards the transaction details to their payment gateway.\nThe payment gateway converts the message from XML to ISO 8583 or a variant message format (format understood by EFT Switches) and then forwards the transaction information to the payment processor used by the merchant's acquiring bank.\nThe payment processor forwards the transaction information to the card association (e.g. Visa, Mastercard), which may act as the issuing bank or route the transaction to the correct card issuing bank.\nThe issuing bank validates the request and sends a response back to the payment processor with a response code to indicate whether the request was approved or denied, along with the reason why the transaction failed if applicable. Meanwhile, the credit card issuer holds an authorization associated with that merchant and consumer for the approved amount.\nThe payment processor forwards the response to the payment gateway, who forwards it to the website.\nThe entire process typically takes 2–3 seconds.\nThe merchant then fulfills the order and the above process can be repeated but this time to \"clear\" the authorization by consummating (e.g. fulfilling) the transaction. This results in the issuing bank \"clearing\" the \"auth\" (i.e. moves auth-hold to a debit) and prepares them to settle with the merchant acquiring bank.\nThe merchant submits all their approved authorizations, in a \"batch\" at the end of the day, to their acquiring bank for settlement via it",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Payment_gateway"
  },
  {
    "title": "Consumer behaviour",
    "content": "Consumer behaviour is the study of individuals, groups, or organisations and all activities associated with the purchase, use and disposal of goods and services. It encompasses how the consumer's emotions, attitudes, and preferences affect buying behaviour, and how external cues—such as visual prompts, auditory signals, or tactile (haptic) feedback—can shape those responses. Consumer behaviour emerged in the 1940–1950s as a distinct sub-discipline of marketing, but has become an interdisciplinary social science that blends elements from psychology, sociology, social anthropology, anthropology, ethnography, ethnology, marketing, and economics (especially behavioural economics).\nThe study of consumer behaviour formally investigates individual qualities such as demographics, personality lifestyles, and behavioural variables (like usage rates, usage occasion, loyalty, brand advocacy, and willingness to provide referrals), in an attempt to understand people's wants and consumption patterns. Consumer behaviour also investigates on the influences on the consumer, from social groups such as family, friends, sports, and reference groups, to society in general (brand-influencers, opinion leaders).\nDue to the unpredictability of consumer behavior, marketers and researchers use ethnography, consumer neuroscience, and machine learning, along with customer relationship management (CRM) databases, to analyze customer patterns. The extensive data from these databases allows for a detailed examination of factors influencing customer loyalty, re-purchase intentions, and other behaviors like providing referrals and becoming brand advocates. Additionally, these databases aid in market segmentation, particularly behavioral segmentation, enabling the creation of highly targeted and personalized marketing strategies.\n\n\nOrigins of consumer behaviour\n\nIn the 1940s and 1950s, marketing was dominated by the so-called classical schools of thought which were highly descriptive and relied heavily on case study approaches with only occasional use of interview methods. At the end of the 1950s, two important reports criticised marketing for its lack of methodological rigor, especially the failure to adopt mathematically-oriented behavioural science research methods. The stage was set for marketing to become more inter-disciplinary by adopting a consumer-behaviourist perspective.\nFrom the 1950s, marketing began to shift its reliance away from economics and towards other disciplines, notably the behavioural sciences, including sociology, anthropology, and clinical psychology. This resulted in a new emphasis on the customer as a unit of analysis. As a result, new substantive knowledge was added to the marketing discipline – including such ideas as opinion leadership, reference groups, and brand loyalty. Market segmentation, especially demographic segmentation based on socioeconomic status (SES) index and household life-cycle, also became fashionable. With the addition of consumer b",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Consumer_behaviour"
  },
  {
    "title": "Shopping cart software",
    "content": "Shopping cart software is e-commerce software on a web server that allows visitors to select items for eventual purchase.\nThe software allows online shopping customers to accumulate a list of items for purchase. At the point of sale, the software typically calculates a total for the order, including freight transport, postage as well as packaging and labeling. Associated taxes are calculated as applicable. This software also allows for a final review of the shortlisted purchase and the choice for a user to modify the purchase. The data is used in online marketing particularly in the form of abandoned carts.\n\n\nHistory\nThe development of web shop systems took place right after the Internet became a mass medium. This was a result of the launch of the browser Mosaic in 1993 and Netscape in 1994. It created an environment in which web shops were possible. The Internet therefore acted as the key infrastructure development that contributed to the rapid diffusion of the e-commerce, a subset of e-business that describes all computer-aided business transactions. In 1998 a total of 11 e-business models were observed, one of which was e-shop business model for a B2C (business-to-consumer) business—also called the “online shop” The two terms “online shop” and “electronic” or “e-shop” are used interchangeably. The term “online shopping” was invented much earlier in 1984.  Today the term primarily refers to the business-to-consumer transactional business. In order to enable “online shopping” a software system is needed. Since “online shopping”, in the context of the B2C business model, became broadly available to the end consumer, internet-based “online shops” evolved.\n\n\nTechnical definition\nThese applications typically provide a means of capturing a client's payment information, but in the case of a credit card they rely on the software module of the secure gateway provider, in conjunction with the secure payment gateway, in order to conduct secure credit card transactions online.\nSome setup must be done in the HTML code of the website, and the shopping cart software must be installed on the server which hosts the site, or on the server which accepts sensitive ordering information. E-shopping carts are usually implemented using HTTP cookies or query strings. In most server based implementations however, data related to the shopping cart is kept in the session object and is accessed and manipulated on the fly, as the user selects different items from the cart. Later in the process of finalizing the transaction, the information is accessed and an order is generated against the selected item thus clearing the shopping cart.\nAlthough the most simple shopping carts strictly allow for an item to be added to a basket to start a checkout process (e.g., the free PayPal shopping cart), most shopping cart software provides additional features that an Internet merchant uses to fully manage an online store. Data (products, categories, discounts, orders, customers, etc.) is",
    "source": "Wikipedia",
    "url": "https://en.wikipedia.org/wiki/Shopping_cart_software"
  },
  {
    "title": "Country Profile: United States Minor Outlying Islands",
    "content": "Country: United States Minor Outlying Islands\n\nOfficial Name: United States Minor Outlying Islands\n\nCapital: Washington DC\n\nRegion: Americas\nSubregion: North America\n\nPopulation: 0\n\nArea: 34.2 km²\n\nLanguages: English\n\nCurrencies: United States dollar ($)\n\nTimezones: UTC-11:00, UTC-10:00, UTC+12:00\n\nBorders: No land borders\n\nTop Level Domain: .us\n\nCalling Code: +68\n\nIndependent: No\n\nUN Member: No",
    "source": "REST Countries API",
    "url": "https://restcountries.com/"
  },
  {
    "title": "Country Profile: United Kingdom",
    "content": "Country: United Kingdom\n\nOfficial Name: United Kingdom of Great Britain and Northern Ireland\n\nCapital: London\n\nRegion: Europe\nSubregion: Northern Europe\n\nPopulation: 69,281,437\n\nArea: 244,376.0 km²\n\nLanguages: English\n\nCurrencies: British pound (£)\n\nTimezones: UTC-08:00, UTC-05:00, UTC-04:00, UTC-03:00, UTC-02:00, UTC, UTC+01:00, UTC+02:00, UTC+06:00\n\nBorders: IRL\n\nTop Level Domain: .uk\n\nCalling Code: +4\n\nIndependent: Yes\n\nUN Member: Yes",
    "source": "REST Countries API",
    "url": "https://restcountries.com/"
  },
  {
    "title": "Country Profile: Germany",
    "content": "Country: Germany\n\nOfficial Name: Federal Republic of Germany\n\nCapital: Berlin\n\nRegion: Europe\nSubregion: Western Europe\n\nPopulation: 83,491,249\n\nArea: 357,114.0 km²\n\nLanguages: German\n\nCurrencies: Euro (€)\n\nTimezones: UTC+01:00\n\nBorders: AUT, BEL, CZE, DNK, FRA, LUX, NLD, POL, CHE\n\nTop Level Domain: .de\n\nCalling Code: +9\n\nIndependent: Yes\n\nUN Member: Yes",
    "source": "REST Countries API",
    "url": "https://restcountries.com/"
  },
  {
    "title": "Country Profile: France",
    "content": "Country: France\n\nOfficial Name: French Republic\n\nCapital: Paris\n\nRegion: Europe\nSubregion: Western Europe\n\nPopulation: 66,351,959\n\nArea: 543,908.0 km²\n\nLanguages: French\n\nCurrencies: Euro (€)\n\nTimezones: UTC-10:00, UTC-09:30, UTC-09:00, UTC-08:00, UTC-04:00, UTC-03:00, UTC+01:00, UTC+02:00, UTC+03:00, UTC+04:00, UTC+05:00, UTC+10:00, UTC+11:00, UTC+12:00\n\nBorders: AND, BEL, DEU, ITA, LUX, MCO, ESP, CHE\n\nTop Level Domain: .fr\n\nCalling Code: +3\n\nIndependent: Yes\n\nUN Member: Yes",
    "source": "REST Countries API",
    "url": "https://restcountries.com/"
  },
  {
    "title": "Country Profile: Japan",
    "content": "Country: Japan\n\nOfficial Name: Japan\n\nCapital: Tokyo\n\nRegion: Asia\nSubregion: Eastern Asia\n\nPopulation: 123,210,000\n\nArea: 377,930.0 km²\n\nLanguages: Japanese\n\nCurrencies: Japanese yen (¥)\n\nTimezones: UTC+09:00\n\nBorders: No land borders\n\nTop Level Domain: .jp, .みんな\n\nCalling Code: +1\n\nIndependent: Yes\n\nUN Member: Yes",
    "source": "REST Countries API",
    "url": "https://restcountries.com/"
  },
  {
    "title": "Country Profile: Canada",
    "content": "Country: Canada\n\nOfficial Name: Canada\n\nCapital: Ottawa\n\nRegion: Americas\nSubregion: North America\n\nPopulation: 41,651,653\n\nArea: 9,984,670.0 km²\n\nLanguages: English, French\n\nCurrencies: Canadian dollar ($)\n\nTimezones: UTC-08:00, UTC-07:00, UTC-06:00, UTC-05:00, UTC-04:00, UTC-03:30\n\nBorders: USA\n\nTop Level Domain: .ca\n\nCalling Code: +\n\nIndependent: Yes\n\nUN Member: Yes",
    "source": "REST Countries API",
    "url": "https://restcountries.com/"
  },
  {
    "title": "Country Profile: Australia",
    "content": "Country: Australia\n\nOfficial Name: Commonwealth of Australia\n\nCapital: Canberra\n\nRegion: Oceania\nSubregion: Australia and New Zealand\n\nPopulation: 27,536,874\n\nArea: 7,692,024.0 km²\n\nLanguages: English\n\nCurrencies: Australian dollar ($)\n\nTimezones: UTC+05:00, UTC+06:30, UTC+07:00, UTC+08:00, UTC+09:30, UTC+10:00, UTC+10:30, UTC+11:30\n\nBorders: No land borders\n\nTop Level Domain: .au\n\nCalling Code: +1\n\nIndependent: Yes\n\nUN Member: Yes",
    "source": "REST Countries API",
    "url": "https://restcountries.com/"
  },
  {
    "title": "Country Profile: Brazil",
    "content": "Country: Brazil\n\nOfficial Name: Federative Republic of Brazil\n\nCapital: Brasília\n\nRegion: Americas\nSubregion: South America\n\nPopulation: 213,421,037\n\nArea: 8,515,767.0 km²\n\nLanguages: Portuguese\n\nCurrencies: Brazilian real (R$)\n\nTimezones: UTC-05:00, UTC-04:00, UTC-03:00, UTC-02:00\n\nBorders: ARG, BOL, COL, GUF, GUY, PRY, PER, SUR, URY, VEN\n\nTop Level Domain: .br\n\nCalling Code: +5\n\nIndependent: Yes\n\nUN Member: Yes",
    "source": "REST Countries API",
    "url": "https://restcountries.com/"
  },
  {
    "title": "Country Profile: British Indian Ocean Territory",
    "content": "Country: British Indian Ocean Territory\n\nOfficial Name: British Indian Ocean Territory\n\nCapital: Diego Garcia\n\nRegion: Africa\nSubregion: Eastern Africa\n\nPopulation: 0\n\nArea: 60.0 km²\n\nLanguages: English\n\nCurrencies: United States dollar ($)\n\nTimezones: UTC+06:00\n\nBorders: No land borders\n\nTop Level Domain: .io\n\nCalling Code: +46\n\nIndependent: No\n\nUN Member: No",
    "source": "REST Countries API",
    "url": "https://restcountries.com/"
  },
  {
    "title": "Country Profile: Taiwan",
    "content": "Country: Taiwan\n\nOfficial Name: Republic of China (Taiwan)\n\nCapital: Taipei\n\nRegion: Asia\nSubregion: Eastern Asia\n\nPopulation: 23,317,031\n\nArea: 36,197.0 km²\n\nLanguages: Chinese\n\nCurrencies: New Taiwan dollar ($)\n\nTimezones: UTC+08:00\n\nBorders: No land borders\n\nTop Level Domain: .tw, .台灣, .台湾\n\nCalling Code: +86\n\nIndependent: No\n\nUN Member: No",
    "source": "REST Countries API",
    "url": "https://restcountries.com/"
  },
  {
    "title": "Book: The Art of War",
    "content": "Book: The Art of War\n\nAuthors: 孙武, Sun Tzu \n\nFirst Published: 1900\n\nSubject: Business\n\nDescription: This book covers topics related to business. It has been referenced 1433 times across different editions.\n\nAvailable editions: 1433\n\nKey: /works/OL244537W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL244537W"
  },
  {
    "title": "Book: As a man thinketh",
    "content": "Book: As a man thinketh\n\nAuthors: James Allen\n\nFirst Published: 1902\n\nSubject: Business\n\nDescription: This book covers topics related to business. It has been referenced 657 times across different editions.\n\nAvailable editions: 657\n\nKey: /works/OL43024W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL43024W"
  },
  {
    "title": "Book: Roughing It",
    "content": "Book: Roughing It\n\nAuthors: Mark Twain\n\nFirst Published: 1872\n\nSubject: Business\n\nDescription: This book covers topics related to business. It has been referenced 408 times across different editions.\n\nAvailable editions: 408\n\nKey: /works/OL54059W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL54059W"
  },
  {
    "title": "Book: Madame Bovary",
    "content": "Book: Madame Bovary\n\nAuthors: Gustave Flaubert\n\nFirst Published: 1856\n\nSubject: Commerce\n\nDescription: This book covers topics related to commerce. It has been referenced 1557 times across different editions.\n\nAvailable editions: 1557\n\nKey: /works/OL893707W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL893707W"
  },
  {
    "title": "Book: Ὀδύσσεια",
    "content": "Book: Ὀδύσσεια\n\nAuthors: Όμηρος\n\nFirst Published: 1488\n\nSubject: Commerce\n\nDescription: This book covers topics related to commerce. It has been referenced 1061 times across different editions.\n\nAvailable editions: 1061\n\nKey: /works/OL61982W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL61982W"
  },
  {
    "title": "Book: The Last of the Mohicans",
    "content": "Book: The Last of the Mohicans\n\nAuthors: James Fenimore Cooper\n\nFirst Published: 1826\n\nSubject: Commerce\n\nDescription: This book covers topics related to commerce. It has been referenced 862 times across different editions.\n\nAvailable editions: 862\n\nKey: /works/OL77958W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL77958W"
  },
  {
    "title": "Book: Kaufmann's",
    "content": "Book: Kaufmann's\n\nAuthors: Letitia Stuart Savage\n\nFirst Published: 2016\n\nSubject: Retail\n\nDescription: This book covers topics related to retail. It has been referenced 3 times across different editions.\n\nAvailable editions: 3\n\nKey: /works/OL25186195W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL25186195W"
  },
  {
    "title": "Book: George's Store",
    "content": "Book: George's Store\n\nAuthors: Frank Asch\n\nFirst Published: 1969\n\nSubject: Retail\n\nDescription: This book covers topics related to retail. It has been referenced 2 times across different editions.\n\nAvailable editions: 2\n\nKey: /works/OL1903057W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL1903057W"
  },
  {
    "title": "Book: John Martin's clerks",
    "content": "Book: John Martin's clerks\n\nAuthors: Frank Farrington\n\nFirst Published: 1907\n\nSubject: Retail\n\nDescription: This book covers topics related to retail. It has been referenced 1 times across different editions.\n\nAvailable editions: 1\n\nKey: /works/OL7678697W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL7678697W"
  },
  {
    "title": "Book: The Art of War",
    "content": "Book: The Art of War\n\nAuthors: 孙武, Sun Tzu \n\nFirst Published: 1900\n\nSubject: Marketing\n\nDescription: This book covers topics related to marketing. It has been referenced 1433 times across different editions.\n\nAvailable editions: 1433\n\nKey: /works/OL244537W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL244537W"
  },
  {
    "title": "Book: Tono-Bungay",
    "content": "Book: Tono-Bungay\n\nAuthors: H. G. Wells\n\nFirst Published: 1890\n\nSubject: Marketing\n\nDescription: This book covers topics related to marketing. It has been referenced 161 times across different editions.\n\nAvailable editions: 161\n\nKey: /works/OL52269W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL52269W"
  },
  {
    "title": "Book: Reconfigurable Processor Array A Bit Sliced Parallel Computer (USA)",
    "content": "Book: Reconfigurable Processor Array A Bit Sliced Parallel Computer (USA)\n\nAuthors: A. Rushton\n\nFirst Published: 1986\n\nSubject: Marketing\n\nDescription: This book covers topics related to marketing. It has been referenced 132 times across different editions.\n\nAvailable editions: 132\n\nKey: /works/OL2829091W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL2829091W"
  },
  {
    "title": "Book: Service management and marketing",
    "content": "Book: Service management and marketing\n\nAuthors: Christian Grönroos\n\nFirst Published: 1990\n\nSubject: Customer Service\n\nDescription: This book covers topics related to customer service. It has been referenced 17 times across different editions.\n\nAvailable editions: 17\n\nKey: /works/OL4792748W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL4792748W"
  },
  {
    "title": "Book: Experiential Marketing",
    "content": "Book: Experiential Marketing\n\nAuthors: Wided Batat\n\nFirst Published: 2019\n\nSubject: Customer Service\n\nDescription: This book covers topics related to customer service. It has been referenced 11 times across different editions.\n\nAvailable editions: 11\n\nKey: /works/OL20520851W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL20520851W"
  },
  {
    "title": "Book: The consumer-- or else!",
    "content": "Book: The consumer-- or else!\n\nAuthors: Camille Passler Schuster, Camille P. Schuster, Donald F. Dufek\n\nFirst Published: 2003\n\nSubject: Customer Service\n\nDescription: This book covers topics related to customer service. It has been referenced 10 times across different editions.\n\nAvailable editions: 10\n\nKey: /works/OL2997787W",
    "source": "Open Library",
    "url": "https://openlibrary.org/works/OL2997787W"
  }
]